Revit.Elements.Element.GetCurves(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.CurveArray@)
Recursively traverse the GeometryElement obtained from this Element, collecting the Curves
geomElem:
curves:

Revit.Elements.Element.GetFaces(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.FaceArray@)
Recursively traverse the GeometryElement obtained from this Element, collecting the Curves
geomElement:
faces: